Repository: OlivierLaHaye/ResumeApp
Catalog: Properties/Resources.*.resx
Languages: fr_ca

# SectionHeaderPhotography
source: Photography
fr_ca: Photographie

# SectionHeaderProjects
source: Projects
fr_ca: Projets

# SectionHeaderSummary
source: Summary
fr_ca: Résumé

# SectionHeaderVisualCraft
source: Visual craft (photography)
fr_ca: Savoir-faire visuel (photographie)

# SectionHeaderWorkPreferences
source: Work preferences
fr_ca: Préférences de travail

# SkillsPageSubtitle
source: Scannable skill groups focused on desktop UI, design systems, and WPF delivery.
fr_ca: Groupes de compétences faciles à scanner, axés sur l’UI desktop, le design system et la livraison WPF.

# SkillsSectionCollaborationItem1
source: UI direction and standards
fr_ca: Direction UI et standards

# SkillsSectionCollaborationItem2
source: Design reviews and dev support
fr_ca: Reviews design et support aux devs

# SkillsSectionCollaborationItem3
source: Stakeholder alignment
fr_ca: Alignement avec les parties prenantes

# SkillsSectionCollaborationItem4
source: QA partnership and iteration
fr_ca: Partenariat QA et itération

# SkillsSectionCollaborationItem5
source: Localization-ready structure
fr_ca: Structure prête pour la localisation

# SkillsSectionCollaborationItem6
source: Clear cross-team communication
fr_ca: Communication claire inter-équipes

# SkillsSectionCollaborationTitle
source: Collaboration and leadership
fr_ca: Collaboration et leadership

# SkillsSectionDesignSystemsItem1
source: Component patterns and reusable UI
fr_ca: Patterns de composants et UI réutilisable

# SkillsSectionDesignSystemsItem2
source: WPF styling and templating
fr_ca: Styles WPF et templating

# SkillsSectionDesignSystemsItem3
source: Design tokens mindset
fr_ca: Mentalité design tokens

# SkillsSectionDesignSystemsItem4
source: Visual states and interaction polish
fr_ca: États visuels et finition d’interaction

# SkillsSectionDesignSystemsItem5
source: Spacing rhythm and layout hierarchy
fr_ca: Rythme d’espacement et hiérarchie de layout

# SkillsSectionDesignSystemsItem6
source: Centralized ResourceDictionary structure
fr_ca: Structure ResourceDictionary centralisée

# SkillsSectionDesignSystemsTitle
source: Design systems and UI craft
fr_ca: Design system et craft UI

# SkillsSectionPrototypingItem1
source: Photoshop high-fidelity mockups
fr_ca: Maquettes Photoshop haute fidélité

# SkillsSectionPrototypingItem2
source: Click-through prototypes
fr_ca: Prototypes cliquables

# SkillsSectionPrototypingItem3
source: Composition and spacing discipline
fr_ca: Composition et discipline d’espacement

# SkillsSectionPrototypingItem4
source: Typography hierarchy
fr_ca: Hiérarchie typographique

# SkillsSectionPrototypingItem5
source: Design to WPF handoff
fr_ca: Passage design vers WPF

# SkillsSectionPrototypingItem6
source: Pixel-level detail and polish
fr_ca: Finition et souci du détail

# SkillsSectionPrototypingTitle
source: Prototyping and visual design
fr_ca: Prototypage et design visuel

# SkillsSectionWpfItem1
source: MVVM, binding, and commands
fr_ca: MVVM, binding et commandes

# SkillsSectionWpfItem2
source: Behaviors and interaction patterns
fr_ca: Behaviors et patterns d’interaction

# SkillsSectionWpfItem3
source: DependencyProperty and custom controls
fr_ca: DependencyProperty et contrôles custom

# SkillsSectionWpfItem4
source: ControlTemplate and DataTemplate
fr_ca: ControlTemplate et DataTemplate

# SkillsSectionWpfItem5
source: Converters and MultiBinding
fr_ca: Converters et MultiBinding

# SkillsSectionWpfItem6
source: Performance-minded UI delivery
fr_ca: Livraison UI avec focus performance

# SkillsSectionWpfTitle
source: WPF and MVVM
fr_ca: WPF et MVVM

# SummaryExperienceLine
source: Experience: 7+ years in software development, 5+ years focused on WPF desktop UI.
fr_ca: Expérience: 7+ ans en développement logiciel, 5+ ans axés sur l’UI desktop WPF.

# SummaryText
source: Senior UI-focused software developer specializing in WPF desktop applications, UI modernization, and design-system execution. I lead UI delivery with a strong standard for consistency, interaction polish, and usability, balancing visual craft with real product constraints. Known for high-fidelity Photoshop mockups that speed up alignment and reduce rework, plus production-ready WPF implementation habits (reusable components, centralized styling, clean interaction patterns, localization-ready structure).
fr_ca: Développeur logiciel senior orienté UI, spécialisé en applications desktop WPF, modernisation UI, et exécution design system. Je mène la livraison UI avec un standard élevé de cohérence, de finition d’interaction, et d’utilisabilité, en gardant l’équilibre entre le beau et les contraintes réelles du produit. Reconnu pour des maquettes Photoshop haute fidélité qui accélèrent l’alignement et réduisent le rework, ainsi que des habitudes d’intégration WPF solides (composants réutilisables, style centralisé, patterns d’interaction propres, structure prête pour la localisation).

# TabEducationTitle
source: Education
fr_ca: Formation

# TabExperienceTitle
source: Experience
fr_ca: Expérience

# TabPhotographyTitle
source: Photography
fr_ca: Photographie

# TabProjectsTitle
source: Projects
fr_ca: Projets

# TabResumeTitle
source: Resume
fr_ca: CV

# TabSkillsTitle
source: Skills
fr_ca: Compétences

# TabVisualCraftTitle
source: Visual craft
fr_ca: Savoir-faire visuel

# TimelineControlInteractionsHelpText
source: Click the timeline, use the mouse wheel to zoom, drag to pan with inertia, click a bar or anywhere on the timeline to select a date.
fr_ca: Cliquez sur la timeline, utilisez la molette pour zoomer, glissez pour déplacer avec inertie, cliquez sur une barre ou n'importe où sur la timeline pour sélectionner une date.

# ValueFullRemoteOnly
source: Full remote only
fr_ca: 100% à distance

# VisualCraftText
source: Professional photographer since 2010 with 20+ years of photo editing experience (since 2001). Visual craft strengthens UI outcomes through disciplined composition, clear visual hierarchy, brand consistency, and detail-level polish.
fr_ca: Photographe professionnel depuis 2010, avec plus de 20 ans d’expérience en retouche photo (depuis 2001). Le savoir-faire visuel renforce les résultats UI via une composition disciplinée, une hiérarchie visuelle claire, une cohérence de marque, et une finition attentive aux détails.
