Repository: OlivierLaHaye/ResumeApp
Catalog: Properties/Resources.*.resx
Languages: fr_ca

# AlbumEventsSubtitle
source: Behind-the-scenes and highlights from live events.
fr_ca: Coulisses et moments forts d’événements.

# AlbumEventsTitle
source: Events
fr_ca: Événements

# AlbumPortraitsSubtitle
source: Studio and on-location portraits with a clean, cinematic look.
fr_ca: Portraits en studio et en extérieur, avec un look propre et cinématographique.

# AlbumVolleyballSubtitle
source: Game action, emotions, and decisive moments.
fr_ca: Action de jeu, émotions, et moments décisifs.

# AppSubtitle
source: UI-focused WPF Front-End Profile
fr_ca: Profil WPF front-end orienté UI

# AppTitle
source: Resume
fr_ca: Curriculum vitae

# ButtonCopyEmail
source: Copy email
fr_ca: Copier le courriel

# ButtonDarkMode
source: Dark mode
fr_ca: Thème sombre

# ButtonDownloadPdf
source: Download PDF
fr_ca: Télécharger en PDF

# ButtonEnglish
source: English
fr_ca: Anglais

# ButtonFrench
source: French
fr_ca: Français

# ButtonLightMode
source: Light mode
fr_ca: Thème clair

# ButtonOpenGitHub
source: Open GitHub
fr_ca: Ouvrir GitHub

# ButtonOpenLinkedIn
source: Open LinkedIn
fr_ca: Ouvrir LinkedIn

# ButtonOpenPortfolio
source: Open portfolio
fr_ca: Ouvrir le portfolio

# ButtonPrint
source: Print
fr_ca: Imprimer

# ButtonProjectViewProject
source: View project
fr_ca: Voir le projet

# ButtonToggleLanguage
source: Switch language
fr_ca: Changer la langue

# ButtonToggleTheme
source: Toggle theme
fr_ca: Changer le thème

# CoreSkillsLine1
source: Design Systems and UI Craft: component patterns, WPF styling, ResourceDictionary architecture, design tokens mindset, visual states, interaction consistency, UI polish
fr_ca: Design system et craft UI: patterns de composants, styles WPF, architecture ResourceDictionary, mindset design tokens, états visuels, cohérence d’interaction, finition UI

# CoreSkillsLine2
source: WPF and C#: WPF, XAML, C# 7.3, MVVM, binding, commands, DependencyProperty, ControlTemplate, DataTemplate, converters, behaviors
fr_ca: WPF et C#: WPF, XAML, C# 7.3, MVVM, binding, commandes, DependencyProperty, ControlTemplate, DataTemplate, converters, behaviors

# CoreSkillsLine3
source: Prototyping and Visual Design: Adobe Photoshop (high-fidelity UI mockups since 2001), visual hierarchy, layout composition, iterative prototyping
fr_ca: Prototypage et design visuel: Adobe Photoshop (maquettes UI haute fidélité depuis 2001), hiérarchie visuelle, composition, prototypage itératif

# CoreSkillsLine4
source: Performance and Responsiveness: perceived performance, smooth scrolling, UI responsiveness, virtualization awareness, profiling mindset
fr_ca: Performance et réactivité: performance perçue, défilement fluide, réactivité UI, notions de virtualisation, mentalité profiling

# CoreSkillsLine5
source: Localization Readiness: resx-based resources, bilingual UX structure, text expansion awareness, layout resilience
fr_ca: Localisation: ressources resx, structure bilingue, expansion du texte, robustesse des layouts

# CoreSkillsLine6
source: Collaboration and Leadership: UI guidance to developers, standards and review support, cross-team alignment, iterative refinement with stakeholders and QA
fr_ca: Collaboration et leadership: guidance UI auprès des développeurs, standards et support en review, alignement inter-équipes, itération avec parties prenantes et QA

# DesignSystemBullet1
source: UI foundations: consistent spacing, typography rhythm, color decisions, and layout hierarchy across screens.
fr_ca: Fondations UI: espacement cohérent, rythme typographique, décisions de couleur, et hiérarchie de layout sur l’ensemble des écrans.

# DesignSystemBullet2
source: Reusable UI: styles, templates, and custom controls that standardize states and interaction patterns (default, hover, pressed, disabled, loading, validation).
fr_ca: UI réutilisable: styles, templates et contrôles personnalisés qui standardisent les états et les patterns (normal, survol, pressé, désactivé, chargement, validation).

# DesignSystemBullet3
source: Theming: light and dark mode driven by centralized resources to keep UI consistent across modules.
fr_ca: Thèmes: clair et sombre pilotés par des ressources centralisées pour garder l’expérience cohérente entre modules.

# DesignSystemBullet4
source: Prototyping workflow: Photoshop mockups that translate into implementation-ready UI decisions and faster cross-team alignment.
fr_ca: Prototypage: maquettes Photoshop qui se traduisent en décisions UI prêtes à intégrer, avec moins d’aller-retour.

# Education1LocationDates
source: Québec, QC, Canada | 2014 to 2018
fr_ca: Québec, QC, Canada | 2014 à 2018

# Education1Title
source: Université Laval | Bachelor’s degree, Computer Science
fr_ca: Université Laval | Baccalauréat en informatique

# Education2LocationDates
source: Québec, QC, Canada | 2008 to 2011
fr_ca: Québec, QC, Canada | 2008 à 2011

# Education2Title
source: Cégep Limoilou | College Diploma, 3D Animation and Image Synthesis
fr_ca: Cégep Limoilou | DEC, Animation 3D et synthèse d’images

# EducationItem1LocationDates
source: Québec, QC, Canada | 2014 to 2018
fr_ca: Québec, QC, Canada | 2014 à 2018

# EducationItem1Title
source: Université Laval | Bachelor’s degree, Computer Science
fr_ca: Université Laval | Baccalauréat en informatique

# EducationItem2LocationDates
source: Québec, QC, Canada | 2008 to 2011
fr_ca: Québec, QC, Canada | 2008 à 2011

# EducationItem2Title
source: Cégep Limoilou | College Diploma, 3D Animation and Image Synthesis
fr_ca: Cégep Limoilou | DEC, Animation 3D et synthèse d’images

# EducationPageSubtitle
source: Degrees and relevant background.
fr_ca: Diplômes et parcours pertinent.

# Experience1AccomplishmentsHeader
source: Selected accomplishments:
fr_ca: Réalisations:

# Experience1Bullet1
source: Led UI modernization to WPF during the transition from VXelements to Creaform.OS, delivering a refreshed look and stronger visual consistency across multiple modules and screens.
fr_ca: Mené la modernisation UI vers WPF dans la transition de VXelements vers Creaform.OS, en livrant un look modernisé et une meilleure cohérence visuelle sur plusieurs modules et écrans.

# Experience1Bullet2
source: Defined and reinforced UI standards (spacing, typography, states, theming rules) to reduce fragmentation and keep the product cohesive.
fr_ca: Défini et renforcé des standards UI (espacement, typographie, états, règles de theming) pour réduire la fragmentation et garder un produit cohérent.

# Experience1Bullet3
source: Produced high-fidelity Photoshop mockups and prototype-ready visuals to validate direction early and reduce late-stage UI churn.
fr_ca: Créé des maquettes Photoshop haute fidélité et des visuels prêts à prototyper pour valider tôt la direction et réduire le churn UI en fin de cycle.

# Experience1Bullet4
source: Served as a go-to UI/UX resource, supporting developers with styling decisions and interaction details to raise overall UI quality.
fr_ca: Agi comme ressource de référence UI/UX, en accompagnant les développeurs sur les décisions de style et les détails d’interaction.

# Experience1LocationDates
source: Lévis, QC, Canada (Hybrid) | 2024-03 to Present
fr_ca: Lévis, QC, Canada (Hybride) | 2024-03 à Présent

# Experience1Scope
source: Scope: Lead UI/UX and front-end delivery across projects, ensuring consistent, high-quality desktop UI.
fr_ca: Portée: Leadership UI/UX et livraison front-end sur plusieurs projets, en assurant une UI desktop cohérente et de haute qualité.

# Experience2AccomplishmentsHeader
source: Selected accomplishments:
fr_ca: Réalisations:

# Experience2Bullet1
source: Designed and delivered a new user interface for peel.OS, improving workflow clarity through simplified navigation, clearer screen structure, and standardized reusable UI patterns.
fr_ca: Conçu et développé une nouvelle interface pour peel.OS, en améliorant la clarté des workflows (navigation, structure des écrans) et en standardisant des patterns UI réutilisables.

# Experience2Bullet2
source: Contributed to peel 3 by Creaform and the peel project team, recognized with the AMETEK Innovation Award 2022, focusing on WPF UI delivery, visual consistency, and interaction polish.
fr_ca: Contribué à peel 3 by Creaform et à l’équipe du projet peel, reconnu par l’AMETEK Innovation Award 2022, avec un focus sur la livraison UI WPF, la cohérence visuelle, et la finition des interactions.

# Experience2Bullet3
source: Shipped WPF UI features with a high standard for usability, visual hierarchy, and interaction polish.
fr_ca: Livré des features WPF avec un standard élevé d’utilisabilité, de hiérarchie visuelle, et de finition d’interaction.

# Experience2LocationDates
source: Québec, QC, Canada | 2020-02 to 2024-03
fr_ca: Québec, QC, Canada | 2020-02 à 2024-03

# Experience2Scope
source: Scope: Front-end focused software development with emphasis on UI design and WPF implementation.
fr_ca: Portée: Développement logiciel avec emphase UI front-end et intégration WPF.

# Experience3AccomplishmentsHeader
source: Selected accomplishments:
fr_ca: Réalisations:

# Experience3Bullet1
source: Built and maintained front-end interfaces using React, JavaScript, and Redux, focusing on clear UI structure and maintainable patterns.
fr_ca: Créé et maintenu des interfaces front-end avec React, JavaScript et Redux, en visant clarté et maintenabilité.

# Experience3Bullet2
source: Created visual assets using Photoshop and Illustrator, supporting product UI and marketing needs.
fr_ca: Conçu des assets visuels avec Photoshop et Illustrator pour soutenir produit et marketing.

# Experience3Bullet3
source: Worked on image processing and media pipelines (OpenCV, Libraw, After Effects) as needed.
fr_ca: Travaillé au besoin sur des volets image et médias (OpenCV, Libraw, After Effects).

# Experience3LocationDates
source: Québec, QC, Canada | 2018-05 to 2020-02
fr_ca: Québec, QC, Canada | 2018-05 à 2020-02

# Experience3Scope
source: Scope: Built front-end interfaces and contributed to visual production.
fr_ca: Portée: UI front-end et production visuelle.

# Experience4AccomplishmentsHeader
source: Selected accomplishments:
fr_ca: Réalisations:

# Experience4Bullet1
source: Delivered features in C# and VB.NET and contributed to unit testing for long-term stability.
fr_ca: Développé des fonctionnalités en C# et VB.NET et contribué aux tests unitaires pour la stabilité.

# Experience4Bullet2
source: Supported Scrum delivery and data workflows using SQL.
fr_ca: Travaillé en Scrum et soutenu des besoins de données via SQL.

# Experience4LocationDates
source: Québec, QC, Canada | 2017-05 to 2017-08
fr_ca: Québec, QC, Canada | 2017-05 à 2017-08

# Experience4Title
source: iA Groupe financier (Industrielle Alliance) | Software Development Intern
fr_ca: iA Groupe financier (Industrielle Alliance) | Stagiaire en développement logiciel

# ExperienceDateRangeSeparator
source: to
fr_ca: à

# ExperienceLegendPaletteText
source: Color helps scan roles quickly.
fr_ca: La couleur aide à repérer les rôles plus vite.

# ExperienceLegendShapeText
source: Shape adds a non-color cue.
fr_ca: La forme ajoute un repère autre que la couleur.

# ExperienceLegendTitle
source: Timeline cues
fr_ca: Repères de timeline

# ExperienceOlhPhotographieAcc1
source: Developed my own software to enhance my photo editing workflow, leveraging my programming skills to innovate and improve UI/UX within my photography practice.
fr_ca: J’ai développé mon propre logiciel pour améliorer mon workflow de retouche photo, en mettant à profit mes compétences en programmation afin d’innover et de peaufiner l’UI/UX dans ma pratique photo.

# ExperienceOlhPhotographieAcc2
source: Over two decades of photo editing experience, starting in 2001.
fr_ca: Plus de 20 ans d’expérience en retouche photo, depuis 2001.

# ExperienceOlhPhotographieAcc3
source: Professional freelance photographer since 2010, with a dedicated portfolio on Instagram (@olhphoto).
fr_ca: Photographe pigiste professionnel depuis 2010, avec un portfolio dédié sur Instagram (@olhphoto).

# ExperienceOlhPhotographieAcc4
source: Areas of expertise: sports, events, landscape, and travel photography.
fr_ca: Domaines d’expertise : photo sportive, événements, paysage et voyage.

# ExperienceOlhPhotographieAcc5
source: Passionate about capturing one-of-a-kind, unforgettable moments that resonate with viewers.
fr_ca: Passionné par la capture de moments uniques et inoubliables qui résonnent avec le public.

# ExperienceOlhPhotographieAcc6
source: Committed to consistently delivering high-quality, visually compelling images.
fr_ca: Engagé à livrer de façon constante des images de grande qualité, fortes visuellement.

# ExperienceOlhPhotographieAcc7
source: Adept at creating images that captivate while conveying a compelling story and a distinctive sense of place.
fr_ca: Habileté à créer des images qui captivent, tout en racontant une histoire et en transmettant un fort sentiment de lieu.

# ExperienceOlhPhotographieRole
source: Experienced Freelance Photographer
fr_ca: Photographe pigiste d’expérience

# ExperienceOlhPhotographieScope
source: Freelance photography and end-to-end post-production for sports, events, landscape, and travel projects.
fr_ca: Photographie pigiste et postproduction de bout en bout pour des projets de sport, d’événements, de paysage et de voyage.

# ExperienceOlhPhotographieTech
source: Adobe Lightroom, Adobe Photoshop, custom C# / WPF tools.
fr_ca: Adobe Lightroom, Adobe Photoshop, outils personnalisés en C# / WPF.

# ExperiencePageSubtitle
source: Role timeline with scope, highlights, and tech stack.
fr_ca: Timeline des rôles avec portée, faits saillants et stack technologique.

# HeaderLocationValue
source: Québec City, QC, Canada
fr_ca: Québec, QC, Canada

# HeaderTargetTitlesValue
source: Senior WPF UI Developer | UI/UX Developer (Desktop Applications) | Front-End Developer, UI Platform (Desktop)
fr_ca: Développeur UI senior (WPF) | Développeur UI/UX (applications desktop) | Développeur front-end, plateforme UI (desktop)

# HeaderWorkPreferenceValue
source: Full remote only, high-trust teams, design-led culture, flexible time off
fr_ca: 100% à distance, équipes basées sur la confiance, culture produit orientée design, vacances flexibles

# HighlightBullet1
source: Led front-end modernization of a flagship desktop product by migrating the UI to WPF and refreshing the visual language during the transition to Creaform.OS, improving consistency across multiple modules and screens, with strong internal feedback.
fr_ca: Mené la modernisation front-end d’un logiciel desktop principal en migrant l’UI vers WPF et en rafraîchissant le langage visuel dans la transition vers Creaform.OS, en améliorant la cohérence visuelle sur plusieurs modules et écrans, avec des retours internes très positifs.

# HighlightBullet2
source: Drove UI direction across projects by defining styling rules and interaction patterns, for example reusable card layouts, consistent button and input states, unified window chrome and title bar behavior, and timeline-style navigation patterns, helping teams ship cohesive, polished UI at scale.
fr_ca: Donner la direction UI sur plusieurs projets en définissant les règles de style et les patterns d’interaction, par exemple des cards réutilisables, des états cohérents pour boutons et champs, un comportement de fenêtre (WindowChrome et title bar) uniforme, et des patterns de navigation de type timeline, pour livrer une UI cohérente et soignée à grande échelle.

# HighlightBullet3
source: Produced high-fidelity Photoshop UI mockups and click-through prototypes for both marketing and development, enabling early validation and reducing late-cycle rework.
fr_ca: Produire des maquettes UI Photoshop haute fidélité et des prototypes cliquables pour le marketing et le développement, permettant de valider tôt la direction et de réduire le rework en fin de cycle.

# HighlightBullet4
source: Designed and delivered a new interface for peel.OS and contributed to peel 3 by Creaform, focusing on information hierarchy, navigation clarity, and reusable WPF patterns (styles, templates, states).
fr_ca: Conçu et livré une nouvelle interface pour peel.OS et contribué à peel 3 by Creaform, avec un focus sur la hiérarchie d’information, la clarté de navigation, et des patterns WPF réutilisables (styles, templates, états).

# HighlightBullet5
source: Built a personal WPF productivity app to accelerate professional photo editing workflows, using it as a UI playground for theming, localization, and interactive controls, including batch import, guided renaming, and productivity-focused quick actions.
fr_ca: Développé un outil personnel WPF pour accélérer le workflow de retouche photo, utilisé comme terrain de jeu UI (theming, localisation, contrôles interactifs), incluant l’import en batch, le renommage guidé, et des actions rapides orientées productivité.

# LabelAccomplishments
source: Accomplishments
fr_ca: Réalisations

# LabelActiveLanguage
source: Active language
fr_ca: Langue active

# LabelCompany
source: Company
fr_ca: Entreprise

# LabelEmail
source: Email
fr_ca: Courriel

# LabelEndDate
source: End date
fr_ca: Date fin

# LabelFullName
source: Full name
fr_ca: Nom complet

# LabelLocation
source: Location
fr_ca: Lieu

# LabelLocationWork
source: Work location
fr_ca: Lieu de travail

# LabelPhone
source: Phone
fr_ca: Téléphone

# LabelPhotoCaption
source: Photo caption
fr_ca: Légende de la photo

# LabelPresent
source: Present
fr_ca: Présent

# LabelProjectConstraints
source: Constraints
fr_ca: Contraintes

# LabelProjectContext
source: Context
fr_ca: Contexte

# LabelProjectLinks
source: Links
fr_ca: Liens

# LabelProjectWhatIBuilt
source: What I built
fr_ca: Ce que j’ai fait

# LabelRole
source: Role
fr_ca: Titre

# LabelScope
source: Scope
fr_ca: Portée

# LabelStartDate
source: Start date
fr_ca: Date début

# LabelTargetTitles
source: Target titles
fr_ca: Titres ciblés

# LabelWorkPreference
source: Work preference
fr_ca: Préférence de travail

# LanguageEnglishCanadaDisplayName
source: English (Canada)
fr_ca: Anglais (Canada)

# LanguageFrenchCanadaDisplayName
source: French (Canada)
fr_ca: Français (Canada)

# OverviewContactComposeEmailButtonText
source: Email
fr_ca: Écrire

# OverviewContactOpenUrlButtonText
source: Open
fr_ca: Ouvrir

# PhotographyPageSubtitle
source: A selection of my work, organized in albums.
fr_ca: Une sélection de mon travail, organisée en albums.

# Project1Bullet1
source: Migrated the UI to WPF and refreshed styling and visual consistency across the product.
fr_ca: Migration UI vers WPF et amélioration de la cohérence visuelle à travers le produit.

# Project1Bullet2
source: Standardized UI patterns and supported key styling decisions to keep the experience cohesive.
fr_ca: Standardisation de patterns UI et support aux décisions de style pour garder une expérience cohérente.

# Project1Constraints
source: Constraints: large UI surface area, consistent visual language, maintainability, delivery timelines.
fr_ca: Contraintes: grande surface UI, langage visuel cohérent, maintenabilité, échéanciers.

# Project1Context
source: Context: Flagship desktop modernization and UI refresh during migration to WPF.
fr_ca: Contexte: Modernisation d’un logiciel desktop principal et rafraîchissement UI pendant la migration vers WPF.

# Project1Impact
source: Impact: strong internal feedback on the refreshed look, with improved visual consistency and reduced UI fragmentation across the product.
fr_ca: Impact: retours internes très positifs sur le look modernisé, avec une cohérence visuelle renforcée et moins de fragmentation UI à travers le produit.

# Project1Title
source: Creaform.OS UI Modernization (internal)
fr_ca: Modernisation UI Creaform.OS (interne)

# Project1WhatIBuiltHeader
source: What I built:
fr_ca: Ce que j’ai fait:

# Project2Bullet1
source: Designed and implemented a new interface focused on clarity, consistency, and usability.
fr_ca: Conception et intégration d’une nouvelle UI, axée sur la clarté, la cohérence, et l’utilisabilité.

# Project2Constraints
source: Constraints: improve UX without disrupting core workflows, clear visual hierarchy, consistent UI patterns.
fr_ca: Contraintes: améliorer l’UX sans perturber les workflows, hiérarchie visuelle claire, patterns cohérents.

# Project2Context
source: Context: UI redesign for a peel software product to improve clarity and usability.
fr_ca: Contexte: Refonte de l’interface d’un produit peel pour améliorer la clarté et l’utilisabilité.

# Project2Impact
source: Impact: clearer, more consistent UI with improved visual hierarchy and workflows that are easier to follow.
fr_ca: Impact: interface plus claire et cohérente, avec une hiérarchie visuelle améliorée et des workflows plus faciles à suivre.

# Project2Title
source: peel.OS UI Redesign
fr_ca: Refonte UI peel.OS

# Project2WhatIBuiltHeader
source: What I built:
fr_ca: Ce que j’ai fait:

# Project3Bullet1
source: End-to-end WPF MVVM app used as a UI playground for theming, localization, and interactive controls.
fr_ca: App WPF MVVM complète utilisée comme terrain de jeu UI (theming, localisation, contrôles interactifs).

# Project3Bullet2
source: Continuous iteration to reduce manual work and improve speed in real workflows.
fr_ca: Itérations continues pour réduire le manuel et augmenter la vitesse dans un workflow réel.

# Project3Constraints
source: Constraints: fast interaction, reliable workflow, UI experimentation, multi-language readiness.
fr_ca: Contraintes: interactions rapides, fiabilité, expérimentation UI, préparation multi-langues.

# Project3Context
source: Context: Personal software to speed up photo editing workflow (import, renaming, repetitive steps) without sacrificing quality.
fr_ca: Contexte: Logiciel personnel pour accélérer le workflow de retouche photo (import, renommage, étapes répétitives) sans réduire la qualité.

# Project3Impact
source: Impact: personal productivity gains by reducing repetitive manual steps and speeding up real editing sessions.
fr_ca: Impact: gains de productivité personnels grâce à la réduction des étapes manuelles répétitives et à une exécution plus rapide des tâches.

# Project3Title
source: OLHphotographie Workflow App (personal)
fr_ca: OLHphotographie Workflow App (personnel)

# Project3WhatIBuiltHeader
source: What I built:
fr_ca: Ce que j’ai fait:

# Project4Bullet1
source: Resume presented as an app with structured sections, consistent styling, and localization resources.
fr_ca: CV présenté en app avec sections structurées, style cohérent, et ressources de localisation.

# Project4Constraints
source: Constraints: clean UI, scannable content, bilingual EN-CA and FR-CA, light and dark mode.
fr_ca: Contraintes: UI propre, contenu scannable, bilingue EN-CA et FR-CA, clair et sombre.

# Project4Context
source: Context: Interactive resume built as a WPF MVVM application with theme and language switching.
fr_ca: Contexte: CV interactif construit en application WPF MVVM avec changement de thème et de langue.

# Project4Links
source: Links: https://github.com/OlivierLaHaye
fr_ca: Liens: https://github.com/OlivierLaHaye

# Project4Tech
source: Tech: WPF, XAML, C# 7.3, MVVM, resx localization
fr_ca: Tech: WPF, XAML, C# 7.3, MVVM, localisation resx

# Project4Title
source: WPF Resume App (this CV)
fr_ca: App CV WPF (ce CV)

# Project4WhatIBuiltHeader
source: What I built:
fr_ca: Ce que j’ai fait:

# SectionHeaderCoreSkills
source: Core skills
fr_ca: Compétences clés

# SectionHeaderDesignSystem
source: Design system and UI development
fr_ca: Design system et développement UI

# SectionHeaderEducation
source: Education
fr_ca: Formation

# SectionHeaderExperience
source: Experience
fr_ca: Expérience

# SectionHeaderHeader
source: Header
fr_ca: En-tête

# SectionHeaderHighlights
source: UI/UX highlights
fr_ca: Faits saillants UI/UX
